CunyServer/app/controllers/admins_controller.rb

INSERT INTO "admins" ("person_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["person_id", 3], ["created_at", "2017-09-15 18:03:25.061577"], ["updated_at", "2017-09-15 18:03:25.061577"]]
INSERT INTO "users" ("username", "password_digest", "email", "auth_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    super
    @admin = Admin.new()
    @admin.person_id = @person.id
    @admin.save
    if @user.save