CunyServer/app/controllers/courses_controller.rb

INSERT INTO "courses" ("professor_id", "name", "description", "cost", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["professor_id", 1], ["name", "Math-101"], ["description", "Basic algebra"], ["cost", 1500], ["created_at", "2017-09-19 18:53:33.928551"], ["updated_at", "2017-09-19 18:53:33.928551"]]
SELECT  "professors".* FROM "professors" WHERE "professors"."person_id" = $1 LIMIT $2  [["person_id", 1], ["LIMIT", 1]]
---
    def create
        course = Course.new(course_params)
        course.professor = current_user.person.professor
        if course.save
            render json: {message: "#{course.name} successfully added to Professor: #{current_user.person.first_name}"}

SELECT "courses".* FROM "courses"
---
    def index
        courses = Course.all