CunyServer/app/controllers/fafsa_accounts_controller.rb

    def create
        @fafsa_account = FafsaAccount.new(user_params)
        if @fafsa_account.save!
---
INSERT INTO "fafsa_accounts" ("financial_account_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["financial_account_id", 1], ["created_at", "2017-09-19 14:13:12.610375"], ["updated_at", "2017-09-19 14:13:12.610375"]]
INSERT INTO "users" ("username", "password_digest", "email", "auth_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"