CunyServer/app/controllers/financial_accounts_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "fafsas".* FROM "fafsas" WHERE "fafsas"."payment_type_id" = $1 LIMIT $2  [["payment_type_id", 1], ["LIMIT", 1]]
SELECT "payment_types".* FROM "payment_types" WHERE "payment_types"."student_id" = $1  [["student_id", 1]]
UPDATE "fafsas" SET "value" = $1, "updated_at" = $2 WHERE "fafsas"."id" = $3  [["value", 3000], ["updated_at", "2017-09-19 15:07:51.155004"], ["id", 1]]
---
    def updateStudentFinance
        puts valueParams
        puts "This is where we change the students reccords"
        student = Student.find(valueParams[:student_id])
        puts "Current Value: #{student.payment_types[0].fafsa.value}"
        student.payment_types[0].fafsa.update({value: valueParams[:value]})