CunyServer/app/controllers/professors_controller.rb

INSERT INTO "professors" ("person_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["person_id", 1], ["created_at", "2017-09-15 18:30:29.174665"], ["updated_at", "2017-09-15 18:30:29.174665"]]
---
    def create
        super
        @professor = Professor.new()
        @professor.person = @person
        if @professor.save

SELECT  "users".* FROM "users" WHERE "users"."auth_token" = $1 LIMIT $2  [["auth_token", "1wZw84vGXgRr4cqYo5Ps43YE"], ["LIMIT", 1]]
---
    def profile
        puts "Current user"
        puts current_user
        # super
        if is_professor?
            puts "headers"
            puts request.headers
            @user = User.find_by_auth_token!(request.headers[:token])