CunyServer/app/controllers/students_controller.rb

    def profile
        puts "Current user"
        puts current_user
        # super
        if is_student? != nil
            puts "headers"
            puts request.headers
            @user = User.find_by_auth_token!(request.headers[:token])
---
SELECT  "users".* FROM "users" WHERE "users"."auth_token" = $1 LIMIT $2  [["auth_token", "xzdkQpsRj1FdjsWvrhq225zM"], ["LIMIT", 1]]