CunyServer/app/controllers/students_controller.rb

INSERT INTO "students" ("person_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["person_id", 3], ["created_at", "2017-09-15 14:18:08.970090"], ["updated_at", "2017-09-15 14:18:08.970090"]]
INSERT INTO "payment_types" ("student_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["student_id", 1], ["created_at", "2017-09-18 19:03:33.307023"], ["updated_at", "2017-09-18 19:03:33.307023"]]
INSERT INTO "fafsas" ("payment_type_id", "value", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["payment_type_id", 1], ["value", 0], ["created_at", "2017-09-18 19:03:33.317889"], ["updated_at", "2017-09-18 19:03:33.317889"]]
INSERT INTO "taps" ("payment_type_id", "value", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["payment_type_id", 1], ["value", 0], ["created_at", "2017-09-18 19:06:07.521249"], ["updated_at", "2017-09-18 19:06:07.521249"]]
INSERT INTO "loans" ("payment_type_id", "value", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["payment_type_id", 1], ["value", 0], ["created_at", "2017-09-18 19:06:07.532167"], ["updated_at", "2017-09-18 19:06:07.532167"]]
INSERT INTO "scholarships" ("payment_type_id", "value", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["payment_type_id", 1], ["value", 0], ["created_at", "2017-09-18 19:06:07.543215"], ["updated_at", "2017-09-18 19:06:07.543215"]]
INSERT INTO "out_of_pockets" ("payment_type_id", "value", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["payment_type_id", 1], ["value", 0], ["created_at", "2017-09-18 19:06:07.554434"], ["updated_at", "2017-09-18 19:06:07.554434"]]
---
    def create
        super
        @student = Student.new()
        @student.person = @person

        if @student.save
        # render json: @user, status: :created, location: @user
            payment_type = PaymentType.new()
            payment_type.student = @student
            payment_type.save!

            #each need to be linked with respective accounts
            f=Fafsa.new({value: 0})
            f.payment_type = payment_type
            f.save!

            t=Tap.new({value: 0})
            t.payment_type = payment_type
            t.save!

            l=Loan.new({value: 0})
            l.payment_type = payment_type
            l.save!

            s=Scholarship.new({value: 0})
            s.payment_type = payment_type
            s.save!

            o=OutOfPocket.new({value: 0});
            o.payment_type = payment_type
            o.save!

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT  "students".* FROM "students" WHERE "students"."person_id" = $1 LIMIT $2  [["person_id", 1], ["LIMIT", 1]]
---
    def registerCourse
        current_user.person.student.courses << Course.find(register_params[:course_id])

UPDATE "out_of_pockets" SET "value" = $1, "updated_at" = $2 WHERE "out_of_pockets"."id" = $3  [["value", nil], ["updated_at", "2017-09-18 19:15:19.270204"], ["id", 1]]
---
    def update_out_of_pocket
        current_user.person.student.payment_types[0].out_of_pocket.update(out_of_pocket_params)

SELECT  "fafsas".* FROM "fafsas" WHERE "fafsas"."payment_type_id" = $1 LIMIT $2  [["payment_type_id", 1], ["LIMIT", 1]]
SELECT  "loans".* FROM "loans" WHERE "loans"."payment_type_id" = $1 LIMIT $2  [["payment_type_id", 1], ["LIMIT", 1]]
SELECT  "out_of_pockets".* FROM "out_of_pockets" WHERE "out_of_pockets"."payment_type_id" = $1 LIMIT $2  [["payment_type_id", 1], ["LIMIT", 1]]
SELECT  "scholarships".* FROM "scholarships" WHERE "scholarships"."payment_type_id" = $1 LIMIT $2  [["payment_type_id", 1], ["LIMIT", 1]]
---
    def finances
        render json: {
            finances: {
                fafsa: current_user.person.student.payment_types[0].fafsa.value,
                out_of_pocket: current_user.person.student.payment_types[0].out_of_pocket.value,
                tap: current_user.person.student.payment_types[0].tap.value,
                scholarship: current_user.person.student.payment_types[0].scholarship.value,
                loan: current_user.person.student.payment_types[0].loan.value,
            }