app/controllers/fafsa_accounts_controller.rb

    def create
        super
        @fafsa_account = FafsaAccount.new()
        @fafsa_account.financial_account = @financial_account
        if @fafsa_account.save!
---
INSERT INTO "fafsa_accounts" ("financial_account_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["financial_account_id", 1], ["created_at", "2017-09-19 14:13:12.610375"], ["updated_at", "2017-09-19 14:13:12.610375"]]
INSERT INTO "financial_accounts" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2017-09-19 14:13:12.592959"], ["updated_at", "2017-09-19 14:13:12.592959"]]