app/controllers/financial_accounts_controller.rb

    def updateStudentFinance
        field=valueParams[:field]
        if financialType.to_sym == field.to_sym
            student = Student.find(valueParams[:student_id])
            prev = student.payment_types[0].send(field).value
---
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "payment_types".* FROM "payment_types" WHERE "payment_types"."student_id" = $1  [["student_id", 1]]